; domain
;; The Towers of Hanoi problem (formalisation by Hector Geffner).

(define (domain hanoi)
  (:requirements :strips)
  (:predicates (clear ?x)       ; ?x is clear (?x is either a disc or a pole)
               (on ?x ?y)       ; ?x is on ?y (?x is a disc; ?y is either a disc or a pole)
               (smaller ?x ?y)) ; ?x is smaller than ?y

  (:action move
    :parameters (?disc ?from ?to)
    :precondition (and (smaller ?disc ?to) 
                       (on ?disc ?from) 
		               (clear ?disc) 
		               (clear ?to))
    :effect  (and (clear ?from) 
                  (on ?disc ?to) 
                  (not (on ?disc ?from))  
		          (not (clear ?to))))
  )

; problem
(define (problem hanoi3)
  (:domain hanoi)
  (:objects pole1 pole2 pole3 d1 d2 d3 d4 d5)
  (:init 
   (smaller d1 pole1) (smaller d2 pole1) (smaller d3 pole1) (smaller d4 pole1) (smaller d5 pole1)
   (smaller d1 pole2) (smaller d2 pole2) (smaller d3 pole2) (smaller d4 pole2) (smaller d5 pole2)
   (smaller d1 pole3) (smaller d2 pole3) (smaller d3 pole3) (smaller d4 pole3) (smaller d5 pole3)
   (smaller d1 d2) (smaller d1 d3) (smaller d1 d4) (smaller d1 d5) 
   (smaller d2 d3) (smaller d2 d4) (smaller d2 d5)
   (smaller d3 d4) (smaller d3 d5)
   (smaller d4 d5)
   (clear pole2) (clear pole3) (clear d1)
   (on d5 pole1) (on d4 d5) (on d3 d4) (on d2 d3) (on d1 d2))
  (:goal (and (on d5 pole3) (on d4 d5) (on d3 d4) (on d2 d3) (on d1 d2)))
  )

; plan
1. (move d1 d2 pole3)
   deleted: (on d1 d2) (clear pole3)
   added: (clear d2) (on d1 pole3)
   goals met: 3 of 5
2. (move d2 d3 pole2)
   deleted: (on d2 d3) (clear pole2)
   added: (clear d3) (on d2 pole2)
   goals met: 2 of 5
3. (move d1 pole3 d2)
   deleted: (on d1 pole3) (clear d2)
   added: (clear pole3) (on d1 d2)
   goals met: 3 of 5
4. (move d3 d4 pole3)
   deleted: (on d3 d4) (clear pole3)
   added: (clear d4) (on d3 pole3)
   goals met: 2 of 5
5. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 1 of 5
6. (move d2 pole2 d3)
   deleted: (on d2 pole2) (clear d3)
   added: (clear pole2) (on d2 d3)
   goals met: 2 of 5
7. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 3 of 5
8. (move d4 d5 pole2)
   deleted: (on d4 d5) (clear pole2)
   added: (clear d5) (on d4 pole2)
   goals met: 2 of 5
9. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 1 of 5
10. (move d2 d3 d5)
   deleted: (on d2 d3) (clear d5)
   added: (clear d3) (on d2 d5)
   goals met: 0 of 5
11. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 1 of 5
12. (move d3 pole3 d4)
   deleted: (on d3 pole3) (clear d4)
   added: (clear pole3) (on d3 d4)
   goals met: 2 of 5
13. (move d1 d2 d3)
   deleted: (on d1 d2) (clear d3)
   added: (clear d2) (on d1 d3)
   goals met: 1 of 5
14. (move d2 d5 pole3)
   deleted: (on d2 d5) (clear pole3)
   added: (clear d5) (on d2 pole3)
   goals met: 1 of 5
15. (move d1 d3 d5)
   deleted: (on d1 d3) (clear d5)
   added: (clear d3) (on d1 d5)
   goals met: 1 of 5
16. (move d2 pole3 d3)
   deleted: (on d2 pole3) (clear d3)
   added: (clear pole3) (on d2 d3)
   goals met: 2 of 5
17. (move d1 d5 d2)
   deleted: (on d1 d5) (clear d2)
   added: (clear d5) (on d1 d2)
   goals met: 3 of 5
18. (move d5 pole1 pole3)
   deleted: (on d5 pole1) (clear pole3)
   added: (clear pole1) (on d5 pole3)
   goals met: 4 of 5
19. (move d1 d2 pole1)
   deleted: (on d1 d2) (clear pole1)
   added: (clear d2) (on d1 pole1)
   goals met: 3 of 5
20. (move d2 d3 d5)
   deleted: (on d2 d3) (clear d5)
   added: (clear d3) (on d2 d5)
   goals met: 2 of 5
21. (move d1 pole1 d2)
   deleted: (on d1 pole1) (clear d2)
   added: (clear pole1) (on d1 d2)
   goals met: 3 of 5
22. (move d3 d4 pole1)
   deleted: (on d3 d4) (clear pole1)
   added: (clear d4) (on d3 pole1)
   goals met: 2 of 5
23. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 1 of 5
24. (move d2 d5 d3)
   deleted: (on d2 d5) (clear d3)
   added: (clear d5) (on d2 d3)
   goals met: 2 of 5
25. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 3 of 5
26. (move d4 pole2 d5)
   deleted: (on d4 pole2) (clear d5)
   added: (clear pole2) (on d4 d5)
   goals met: 4 of 5
27. (move d1 d2 d4)
   deleted: (on d1 d2) (clear d4)
   added: (clear d2) (on d1 d4)
   goals met: 3 of 5
28. (move d2 d3 pole2)
   deleted: (on d2 d3) (clear pole2)
   added: (clear d3) (on d2 pole2)
   goals met: 2 of 5
29. (move d1 d4 d2)
   deleted: (on d1 d4) (clear d2)
   added: (clear d4) (on d1 d2)
   goals met: 3 of 5
30. (move d3 pole1 d4)
   deleted: (on d3 pole1) (clear d4)
   added: (clear pole1) (on d3 d4)
   goals met: 4 of 5
31. (move d1 d2 pole1)
   deleted: (on d1 d2) (clear pole1)
   added: (clear d2) (on d1 pole1)
   goals met: 3 of 5
32. (move d2 pole2 d3)
   deleted: (on d2 pole2) (clear d3)
   added: (clear pole2) (on d2 d3)
   goals met: 4 of 5
33. (move d1 pole1 d2)
   deleted: (on d1 pole1) (clear d2)
   added: (clear pole1) (on d1 d2)
   goals met: 5 of 5
